{"id": 6193, "text": "Purchase Order Number STA211512014078 Anne Arundel Co School Dist Your Savvas Email Address What do you need help with Customer Service Who will resolve this issue Core Curriculum What can we assist with Submitting New Order or Purchase Order Is this a credit card order that requires a callback No List the ISBNs, titles, and quantities See attached Description, Reason, or Additional Information Hello, Please process the attached Purchase Order  STA211512014078 for Anne Arundel. Thank you Cassidy Parsons Upload a File Scanned from a Xerox Multifunction Printer007 (3).pdf Account Name Anne Arundel Co School Dist ZIP Code 21401 Customer Name Cassidy Parsons Customer Phone (480) 4576093 Customer Email Customer's Role Sales Ops Who should we reach out to Me", "filename": "filename.json", "annotations": [{"id": "6193", "label": "NEW_ORDER", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6186, "text": "Internal CS Core Majors Request Other Weatherly Area School District Order on Hold Number 2618 Your Savvas Email Address What do you need help with Customer Service Who will resolve this issue Core Curriculum Major Accounts What can we assist with Order on Hold What is the specific hold issue Other Doc Control, Order, Invoice, or Purchase Order  Number Purchase Order  E0002759YR2 Description, Reason, or Additional Information This order was supposed to be shipped on May 28th and wasn't. I believe it might be due to shipping information. I just called the district and they are open to accept shipments Monday Friday 7am 315 pm. If this is the hold up, please process this immediately as the customer is angry. If this is not the case, please advice so that I can get this shipped. Thank you, What is the Major Account Other Other Major Account Weatherly Area School District Customer Name Anthony Despirito Customer Phone Number (570) 4278681 Customer Email Customer's Role Administrator Who should we reach out to Me", "filename": "filename.json", "annotations": [{"id": "6186", "label": "OTHERS", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6182, "text": "JUST CURIOUS ..WHY ARE THE Mississippi Specific titles NOT YET Published  Martha C. Cooke School Book Supply Company Phone 6013527272 [SBMS Logo.JPG]", "filename": "filename.json", "annotations": [{"id": "6182", "label": "OTHERS", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6184, "text": "Internal CS Core New Order or Quote Request Anne Arundel Co School Dist Submitting New Order or Purchase Order Number 281 Your Savvas Email Address What do you need help with Customer Service Who will resolve this issue Core Curriculum What can we assist with Submitting New Order or Purchase Order Is this a credit card order that requires a callback No List the ISBNs, titles, and quantities See Attached Description, Reason, or Additional Information Hello, Please process the attached Purchase Order  STA211512014083 for Anne Arundel. Thank you Cassidy Parsons Upload a File Scanned from a Xerox Multifunction Printer001 (3).pdf Account Name Anne Arundel Co School Dist ZIP Code 21401 Customer Name Cassidy Parsons Customer Phone (480) 4576093 Customer Email Customer's Role Sales Ops Who should we reach out to Me", "filename": "filename.json", "annotations": [{"id": "6184", "label": "NEW_ORDER", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6183, "text": "Customer Service Support Request ~ Renewal Requests & Information ~ Instructional Resources/Products/Textbooks~ DoDEA EuropeSouthAE ~ [Number 864] Contact Name Todd Quinton  Contact Email  Contact Phone 393471394285  Your Role Teacher  Account, District or Organization Name DoDEA EuropeSouth  Account, District or Organization Address PSC 808 Box 1967 FPurchase Order , AE 09618 United States School Name (if applicable) Naples Middle High School  Type of Product (choose one) Instructional Resources/Products/Textbooks  Type of Request Renewal Requests & Information  Description of Request I am responding to a request for information sent to me by email on 26JUN2020. The email asked for me to respond with certain information, but the email server returned the email as undeliverable. I am responding now with the requested information. School Name Naples MIddle High School School Address PSC 808 Box 1967, FPurchase Order  AE 09618 School Email  Do You Have Any of the Following (Check all that apply)  Existing Case Number  Existing Case Number 03474723", "filename": "filename.json", "annotations": [{"id": "6183", "label": "OTHERS", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6185, "text": "Internal CS Core New Order or Quote Request Anne Arundel Co School Dist Submitting New Order or Purchase Order Number 195 Your Savvas Email Address What do you need help with Customer Service Who will resolve this issue Core Curriculum What can we assist with Submitting New Order or Purchase Order Is this a credit card order that requires a callback No List the ISBNs, titles, and quantities See Attached Description, Reason, or Additional Information Hello, Please process the attached Purchase Order  for Anne Arundel. Attached is Purchase Order  STA201112004080 Thank you Cassidy Parsons Upload a File Anne Arundel County Public School Purchase Order s (4)1.pdf Account Name Anne Arundel Co School Dist ZIP Code 21401 Customer Name Cassidy Parsons Customer Phone (480) 4576093 Customer Email Customer's Role Sales Ops Who should we reach out to Me", "filename": "filename.json", "annotations": [{"id": "6185", "label": "NEW_ORDER", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6188, "text": "Internal CS Core Majors Request Texas Education Agency (TEA) Order Problem Number 2775 Your Savvas Email Address What do you need help with Customer Service Who will resolve this issue Core Curriculum Major Accounts What can we assist with Order Problem What is the specific problem with the order Other Doc Control, Order, Invoice, or Purchase Order  Number 1008979038 ISBN 0000123690 Quantity 1 Description, Reason, or Additional Information Two requests. 1. This is an EMAT order and the following lines items were processed as a charge item. These should be gratis as part of the package. Please credit/correct the following DOC 1008979038 Line 7 0000123690 qty 1776 $14,208.00 Should be $0 Line 10 0000123690 qty 1662 $13,296.00 Should be $0 Line 14 0000123690 qty 1689 $13,512.00 Should be $0 Line 18 0000123690 qty 972 $7,776.00 Should be $0 TOTAL DOLLAR VALUE REMOVED $48,792.00 New total on Order $432,851.15 $48,792.00 = $384,059.15 2. Please create a desktop copy for their eligible frees. I have attached form and a copy of their quote. These may ship immediately. Upload a File Texas City Desktop for TEA 1008979038 8420.pdf What is the Major Account Texas Education Agency (TEA) Customer Name Geny White Customer Phone Number 4099160127 Customer Email Customer's Role District/School Staff Who should we reach out to Me", "filename": "filename.json", "annotations": [{"id": "6188", "label": "OTHERS", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6191, "text": "Dispatched Purchase Order Purchase Order  01100 / 0000011256, has been Dispatched. Please confirm receipt of Purchase Order . Download and process attached Purchase Order .", "filename": "filename.json", "annotations": [{"id": "6191", "label": "OTHERS", "user": 1}], "meta": {}, "annotation_approver": null}
{"id": 6187, "text": "Ordering Hi there, I need assistance with my order. I am not sure of the ISBN numbers. I am looking to order Envision math hardback books for 48th grades. Last year our school ordered the 6YEAR SUBSCRIPTION + DIGITAL COURSEWARE 6YEAR LICENSE and we need to replace some of the consumable math books. I'd really like to replace them with hardback books. I'm also investigating new spelling books for 2nd 6th graders. If I could get some help with this process, that would be greatly appreciated. Lastly, I'd like to replenish our stock of interactive science books for 1st5th. My number is 15308424509 ex. 213 Cell number is 5309210430 I look forward to hearing from you soon. Thank you, Colleen Allen", "filename": "filename.json", "annotations": [{"id": "6187", "label": "NEW_ORDER", "user": 1}], "meta": {}, "annotation_approver": null}
